{
	"partition": {
		"label": "Partition divided Bengal along religious lines",
		"paragraphs": [
			"In 1947, British India was divided. Bengal was split along religious lines: the west became India, the east became East Pakistan (later Bangladesh). Partition triggered one of history's largest mass migrations. Between 10 and 20 million people crossed borders. Up to two million died. Villages were cut in half.",
			"The Assam government encouraged Bengali Muslim peasants to settle on unwanted char lands and work tea plantations. Families were given land. They built homes. Seventy-five years later, their children hold Indian citizenship documents yet are labelled \"illegal Bangladeshis\" and evicted. Partition's violence continues through citizenship registers, eviction drives, and bulldozers."
		]
	},
	"rss": {
		"label": "The RSS",
		"paragraphs": [
			"The Rashtriya Swayamsevak Sangh (RSS), founded in 1925, is a Hindu nationalist volunteer organisation that promotes the ideology of Hindutva and has played a central role in shaping India's broader Hindu nationalist movement. Its ideological influence extends across a network of affiliated groups, including those within the ruling political establishment, like Sarma's BJP."
		]
	},
	"nagaland": {
		"label": "Nagaland was carved out of Assam in 1963",
		"paragraphs": [
			"Nagaland was carved out of Assam in 1963 as a political concession to end a violent separatist insurgency. After India's independence, the Naga National Council, led by Zapu Phizo, demanded a sovereign Naga homeland and launched an armed rebellion that forced the Indian Army to move in by 1955. Years of negotiations eventually produced the 16-Point Agreement of 1960 between Naga leaders and the Indian government, under which the Nagas agreed to remain within the Indian Union in exchange for full statehood and special constitutional protections for their customs and land rights under Article 371A.",
			"Nagaland formally became India's 16th state on December 1, 1963 – but the insurgency never fully ended, and several armed Naga factions continued to operate in the region for decades."
		]
	}
}
